<!-- terraform-plan: aurora-mysql/aurora-test004 -->
### Plan: `aurora-mysql/aurora-test004`

<details><summary>Show plan output</summary>

```
05:32:24.900 STDOUT terraform: Acquiring state lock. This may take a few moments...
05:32:27.565 STDOUT terraform: module.aurora-test004.data.aws_ssm_parameter.vpc_id: Reading...
05:32:28.202 STDOUT terraform: module.aurora-test004.data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/dev/vpc/vpc-id]
05:32:28.353 STDOUT terraform: Terraform used the selected providers to generate the following execution
05:32:28.353 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
05:32:28.353 STDOUT terraform:   + create
05:32:28.353 STDOUT terraform: Terraform will perform the following actions:
05:32:28.354 STDOUT terraform:   # module.aurora-test004.aws_rds_cluster.this will be created
05:32:28.354 STDOUT terraform:   + resource "aws_rds_cluster" "this" {
05:32:28.354 STDOUT terraform:       + allocated_storage                     = (known after apply)
05:32:28.354 STDOUT terraform:       + apply_immediately                     = (known after apply)
05:32:28.354 STDOUT terraform:       + arn                                   = (known after apply)
05:32:28.354 STDOUT terraform:       + availability_zones                    = (known after apply)
05:32:28.354 STDOUT terraform:       + backtrack_window                      = 0
05:32:28.355 STDOUT terraform:       + backup_retention_period               = 1
05:32:28.355 STDOUT terraform:       + ca_certificate_identifier             = (known after apply)
05:32:28.355 STDOUT terraform:       + ca_certificate_valid_till             = (known after apply)
05:32:28.355 STDOUT terraform:       + cluster_identifier                    = "aurora-test004"
05:32:28.355 STDOUT terraform:       + cluster_identifier_prefix             = (known after apply)
05:32:28.355 STDOUT terraform:       + cluster_members                       = (known after apply)
05:32:28.355 STDOUT terraform:       + cluster_resource_id                   = (known after apply)
05:32:28.355 STDOUT terraform:       + cluster_scalability_type              = (known after apply)
05:32:28.355 STDOUT terraform:       + copy_tags_to_snapshot                 = true
05:32:28.355 STDOUT terraform:       + database_insights_mode                = (known after apply)
05:32:28.355 STDOUT terraform:       + database_name                         = (known after apply)
05:32:28.355 STDOUT terraform:       + db_cluster_parameter_group_name       = "aurora-test004-cpg"
05:32:28.355 STDOUT terraform:       + db_subnet_group_name                  = "shared-dev-rds-db-subnet-group"
05:32:28.355 STDOUT terraform:       + db_system_id                          = (known after apply)
05:32:28.355 STDOUT terraform:       + delete_automated_backups              = true
05:32:28.355 STDOUT terraform:       + deletion_protection                   = true
05:32:28.355 STDOUT terraform:       + enable_global_write_forwarding        = false
05:32:28.355 STDOUT terraform:       + enable_http_endpoint                  = false
05:32:28.355 STDOUT terraform:       + enable_local_write_forwarding         = false
05:32:28.356 STDOUT terraform:       + endpoint                              = (known after apply)
05:32:28.356 STDOUT terraform:       + engine                                = "aurora-mysql"
05:32:28.356 STDOUT terraform:       + engine_lifecycle_support              = (known after apply)
05:32:28.356 STDOUT terraform:       + engine_mode                           = "provisioned"
05:32:28.356 STDOUT terraform:       + engine_version                        = "8.0.mysql_aurora.3.10.3"
05:32:28.356 STDOUT terraform:       + engine_version_actual                 = (known after apply)
05:32:28.356 STDOUT terraform:       + final_snapshot_identifier             = (known after apply)
05:32:28.356 STDOUT terraform:       + hosted_zone_id                        = (known after apply)
05:32:28.356 STDOUT terraform:       + iam_roles                             = (known after apply)
05:32:28.356 STDOUT terraform:       + id                                    = (known after apply)
05:32:28.356 STDOUT terraform:       + kms_key_id                            = (known after apply)
05:32:28.356 STDOUT terraform:       + manage_master_user_password           = true
05:32:28.356 STDOUT terraform:       + master_user_secret                    = (known after apply)
05:32:28.356 STDOUT terraform:       + master_user_secret_kms_key_id         = (known after apply)
05:32:28.356 STDOUT terraform:       + master_username                       = "admin"
05:32:28.356 STDOUT terraform:       + monitoring_interval                   = (known after apply)
05:32:28.356 STDOUT terraform:       + monitoring_role_arn                   = (known after apply)
05:32:28.357 STDOUT terraform:       + network_type                          = (known after apply)
05:32:28.357 STDOUT terraform:       + performance_insights_kms_key_id       = (known after apply)
05:32:28.357 STDOUT terraform:       + performance_insights_retention_period = (known after apply)
05:32:28.357 STDOUT terraform:       + port                                  = (known after apply)
05:32:28.357 STDOUT terraform:       + preferred_backup_window               = "18:00-19:00"
05:32:28.357 STDOUT terraform:       + preferred_maintenance_window          = "sun:19:00-sun:20:00"
05:32:28.357 STDOUT terraform:       + reader_endpoint                       = (known after apply)
05:32:28.357 STDOUT terraform:       + skip_final_snapshot                   = false
05:32:28.357 STDOUT terraform:       + storage_encrypted                     = true
05:32:28.357 STDOUT terraform:       + storage_type                          = (known after apply)
05:32:28.357 STDOUT terraform:       + tags                                  = {
05:32:28.357 STDOUT terraform:           + "Name" = "aurora-test004"
05:32:28.357 STDOUT terraform:         }
05:32:28.357 STDOUT terraform:       + tags_all                              = {
05:32:28.357 STDOUT terraform:           + "Environment" = "dev"
05:32:28.357 STDOUT terraform:           + "ManagedBy"   = "Terraform"
05:32:28.357 STDOUT terraform:           + "Name"        = "aurora-test004"
05:32:28.357 STDOUT terraform:         }
05:32:28.357 STDOUT terraform:       + vpc_security_group_ids                = (known after apply)
05:32:28.357 STDOUT terraform:     }
05:32:28.357 STDOUT terraform:   # module.aurora-test004.aws_rds_cluster_instance.this[0] will be created
05:32:28.357 STDOUT terraform:   + resource "aws_rds_cluster_instance" "this" {
05:32:28.357 STDOUT terraform:       + apply_immediately                     = (known after apply)
05:32:28.358 STDOUT terraform:       + arn                                   = (known after apply)
05:32:28.358 STDOUT terraform:       + auto_minor_version_upgrade            = true
05:32:28.358 STDOUT terraform:       + availability_zone                     = (known after apply)
05:32:28.358 STDOUT terraform:       + ca_cert_identifier                    = (known after apply)
05:32:28.358 STDOUT terraform:       + cluster_identifier                    = (known after apply)
05:32:28.358 STDOUT terraform:       + copy_tags_to_snapshot                 = false
05:32:28.358 STDOUT terraform:       + db_parameter_group_name               = (known after apply)
05:32:28.358 STDOUT terraform:       + db_subnet_group_name                  = (known after apply)
05:32:28.358 STDOUT terraform:       + dbi_resource_id                       = (known after apply)
05:32:28.358 STDOUT terraform:       + endpoint                              = (known after apply)
05:32:28.358 STDOUT terraform:       + engine                                = "aurora-mysql"
05:32:28.358 STDOUT terraform:       + engine_version                        = "8.0.mysql_aurora.3.10.3"
05:32:28.358 STDOUT terraform:       + engine_version_actual                 = (known after apply)
05:32:28.358 STDOUT terraform:       + force_destroy                         = false
05:32:28.358 STDOUT terraform:       + id                                    = (known after apply)
05:32:28.358 STDOUT terraform:       + identifier                            = "aurora-test004-0"
05:32:28.358 STDOUT terraform:       + identifier_prefix                     = (known after apply)
05:32:28.358 STDOUT terraform:       + instance_class                        = "db.t4g.medium"
05:32:28.358 STDOUT terraform:       + kms_key_id                            = (known after apply)
05:32:28.359 STDOUT terraform:       + monitoring_interval                   = 0
05:32:28.359 STDOUT terraform:       + monitoring_role_arn                   = (known after apply)
05:32:28.359 STDOUT terraform:       + network_type                          = (known after apply)
05:32:28.359 STDOUT terraform:       + performance_insights_enabled          = (known after apply)
05:32:28.359 STDOUT terraform:       + performance_insights_kms_key_id       = (known after apply)
05:32:28.359 STDOUT terraform:       + performance_insights_retention_period = (known after apply)
05:32:28.359 STDOUT terraform:       + port                                  = (known after apply)
05:32:28.359 STDOUT terraform:       + preferred_backup_window               = (known after apply)
05:32:28.359 STDOUT terraform:       + preferred_maintenance_window          = (known after apply)
05:32:28.359 STDOUT terraform:       + promotion_tier                        = 0
05:32:28.359 STDOUT terraform:       + publicly_accessible                   = (known after apply)
05:32:28.359 STDOUT terraform:       + storage_encrypted                     = (known after apply)
05:32:28.359 STDOUT terraform:       + tags                                  = {
05:32:28.359 STDOUT terraform:           + "Name" = "aurora-test004-0"
05:32:28.359 STDOUT terraform:         }
05:32:28.359 STDOUT terraform:       + tags_all                              = {
05:32:28.359 STDOUT terraform:           + "Environment" = "dev"
05:32:28.360 STDOUT terraform:           + "ManagedBy"   = "Terraform"
05:32:28.360 STDOUT terraform:           + "Name"        = "aurora-test004-0"
05:32:28.360 STDOUT terraform:         }
05:32:28.360 STDOUT terraform:       + writer                                = (known after apply)
05:32:28.360 STDOUT terraform:     }
05:32:28.360 STDOUT terraform:   # module.aurora-test004.aws_rds_cluster_parameter_group.this will be created
05:32:28.360 STDOUT terraform:   + resource "aws_rds_cluster_parameter_group" "this" {
05:32:28.360 STDOUT terraform:       + arn         = (known after apply)
05:32:28.360 STDOUT terraform:       + description = "Managed by Terraform"
05:32:28.360 STDOUT terraform:       + family      = "aurora-mysql8.0"
05:32:28.360 STDOUT terraform:       + id          = (known after apply)
05:32:28.360 STDOUT terraform:       + name        = "aurora-test004-cpg"
05:32:28.360 STDOUT terraform:       + name_prefix = (known after apply)
05:32:28.360 STDOUT terraform:       + tags        = {
05:32:28.360 STDOUT terraform:           + "Name" = "aurora-test004-cpg"
05:32:28.360 STDOUT terraform:         }
05:32:28.360 STDOUT terraform:       + tags_all    = {
05:32:28.360 STDOUT terraform:           + "Environment" = "dev"
05:32:28.360 STDOUT terraform:           + "ManagedBy"   = "Terraform"
05:32:28.360 STDOUT terraform:           + "Name"        = "aurora-test004-cpg"
05:32:28.360 STDOUT terraform:         }
05:32:28.360 STDOUT terraform:     }
05:32:28.360 STDOUT terraform:   # module.aurora-test004.aws_security_group.this will be created
05:32:28.360 STDOUT terraform:   + resource "aws_security_group" "this" {
05:32:28.360 STDOUT terraform:       + arn                    = (known after apply)
05:32:28.360 STDOUT terraform:       + description            = "Managed by Terraform"
05:32:28.361 STDOUT terraform:       + egress                 = [
05:32:28.361 STDOUT terraform:           + {
05:32:28.361 STDOUT terraform:               + cidr_blocks      = [
05:32:28.361 STDOUT terraform:                   + "0.0.0.0/0",
05:32:28.361 STDOUT terraform:                 ]
05:32:28.361 STDOUT terraform:               + from_port        = 0
05:32:28.361 STDOUT terraform:               + ipv6_cidr_blocks = []
05:32:28.361 STDOUT terraform:               + prefix_list_ids  = []
05:32:28.361 STDOUT terraform:               + protocol         = "-1"
05:32:28.361 STDOUT terraform:               + security_groups  = []
05:32:28.361 STDOUT terraform:               + self             = false
05:32:28.361 STDOUT terraform:               + to_port          = 0
05:32:28.361 STDOUT terraform:                 # (1 unchanged attribute hidden)
05:32:28.361 STDOUT terraform:             },
05:32:28.361 STDOUT terraform:         ]
05:32:28.361 STDOUT terraform:       + id                     = (known after apply)
05:32:28.361 STDOUT terraform:       + ingress                = (known after apply)
05:32:28.361 STDOUT terraform:       + name                   = (known after apply)
05:32:28.361 STDOUT terraform:       + name_prefix            = "aurora-test004-"
05:32:28.361 STDOUT terraform:       + owner_id               = (known after apply)
05:32:28.361 STDOUT terraform:       + revoke_rules_on_delete = false
05:32:28.361 STDOUT terraform:       + tags                   = {
05:32:28.361 STDOUT terraform:           + "Name" = "aurora-test004-sg"
05:32:28.361 STDOUT terraform:         }
05:32:28.361 STDOUT terraform:       + tags_all               = {
05:32:28.361 STDOUT terraform:           + "Environment" = "dev"
05:32:28.361 STDOUT terraform:           + "ManagedBy"   = "Terraform"
05:32:28.361 STDOUT terraform:           + "Name"        = "aurora-test004-sg"
05:32:28.361 STDOUT terraform:         }
05:32:28.361 STDOUT terraform:       + vpc_id                 = (sensitive value)
05:32:28.361 STDOUT terraform:     }
05:32:28.361 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
05:32:28.361 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
05:32:28.361 STDOUT terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
05:32:28.362 STDOUT terraform: guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>